[
  {
    "SlNo":1,
    "Feature":"Customer Registration (Web)",
    "Story number":"US001",
    "Description (Card)":"As a new customer, I want to register by providing my personal details, so that I can create an account and access the hotel booking system.",
    "Acceptance Criteria (Confirmation)":"Customer should be able to acess registration page from the homepage.\n1. It should have a clean UI with a heading: \"Customer Registration\".\n\tThe page should include the following fields:\n\t\t-Customer Name (Text input, Required)\n\t\t-Email (Text input, Required, Unique)\n\t\t-Mobile Number (Country Code Dropdown + Number Input, Required, Unique)\n\t\t-Address (Textarea, Required)\n\t\t-Username (Text input, Required, Unique)\n\t\t-Password (Password input, Required)\n\t\t-Confirm Password (Password input, Required, Must match Password)\n\t\t-Register Button (Disabled until all fields are valid)\n\t\t-Reset Button (Clears all input fields)\n\t\t\nField Validations & Error Messages:\n1. Customer Name: Required, Minimum 3 characters, Only alphabets & spaces allowed\t\n\t-In case of error : \"Name must be at least 3 characters long and contain only letters.\"\n2. Email: Required, Valid Email Format (example@domain.com), Unique\t\n\t- In case of error: \"Enter a valid email address.\" \n      -In case of duplicate registration: \"Email already registered”.\n3. Mobile Number: Required, Country Code Dropdown (Mandatory), Only numbers, Min: 8 digits, Max: 10 digits, Unique\t\n\t- In case of error : \"Enter a valid mobile number.\" \/ \"Mobile number already registered.\"\n4. Address: Required, Minimum 10 characters\t\n\t- In case of error: \"Address must be at least 10 characters long.\"\n5. Username: Required, Min: 5 characters, No spaces, Unique\t\n\t- In case of erro: \"Username must be at least 5 characters and unique.\"\n6. Password: Required, Min: 8 characters, Must contain at least 1 uppercase, 1 lowercase, 1 digit, and 1 special character\t\n\t- In case of error: \"Password must be at least 8 characters and include a mix of uppercase, lowercase, number, and special character.\"\n7. Confirm Password: Required, Must match Password\t\n\t- In case of error: \"Passwords do not match.\"\n8. Register Button: Enabled only when all fields are valid.\n9. Passwords should be encrypted before storing in the database.\n\nSuccessful Registration Flow\n1️.User fills in the registration form with all required details.\n2️.User clicks the Register button.\n3️.System validates the input fields.\n4️.If validation passes, the system:\n\t-Generates a random User ID .\n\t-Stores user details securely in the database.\n5️.User is redirected to an Acknowledgement Screen displaying:\n\t-\"Registration Successful!\" message.\n\t-Generated User ID.\n\t-Customer Name & Email.\n6️.The user is provided with a Login Now button.\n\n* Encrypt the password while saving in the database using some industry accepted encryption mechanism.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":2,
    "Feature":"Login (Web)",
    "Story number":"US002",
    "Description (Card)":"As a registered customer, I want to log in using my credentials, so that I can access my account and manage my hotel bookings.",
    "Acceptance Criteria (Confirmation)":"The login page should have:\n\t-Username:(Required)\n\t-Password: (Required)\n\t-Login Button\n\t-Forgot Password? (Redirects to password reset page)\n\t-Register Now (Redirects to the registration page)\n\nLogin Error Messages\n-\"Invalid username or password.\" (If credentials don't match)\n-\"Your account is locked. Please contact support.\" (If multiple failed attempts)\n-Implement account lockout after multiple failed login attempts.\n-Passwords should be stored securely using encryption.\n\nSuccessful Login Flow\n1️. User enters Username & Password.\n2️. Clicks Login.\n3️. System validates credentials.\n4️. If valid, user is redirected to customer dashboard.\n5️. If invalid, an error message is displayed.\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":3,
    "Feature":"Homepage (Web)",
    "Story number":"US003",
    "Description (Card)":"As a customer, I want to access the homepage to view features offered, so that I can easily navigate and understand the services available.",
    "Acceptance Criteria (Confirmation)":"1. Home Page Layout & Navigation\nThe home page should display a personalized welcome message with the customer’s name (e.g., \"Welcome, <name>!\").\n\nThe navigation menu should include the following options:\n\t-Home (Redirects to the main landing page)\n\t-Search Room Availability (Displays search form with required fields)\n\t-My Bookings (Displays current and past bookings, Update or cancel reservations, Download invoices and receipts.)\n\t-Contact Us (Displays hotel contact details & support options)\n\t-Register Complaint (Allows the user to submit a complaint, See a list of their registered complaints,View complaint statuses (Pending, In Progress, Resolved) )\n\t-Profile (Shows customer details, edit profile, logout)\n\nAll menu options should be clickable and redirect to the appropriate pages.\n\n2. Profile Section & Logout\n\nThe profile section should include:\n\t-My Profile (Displays customer name, email, mobile number, address)\n\t-Edit Profile option to update personal details\n\t-Logout Button to securely log out of the system. Clicking Logout should:\n\t\t-End the session\n\t\t-Redirect the user to the login page\n\t\t-Prevent access to the home page after logout\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":4,
    "Feature":"Search Room Availability (Web)",
    "Story number":"US004",
    "Description (Card)":"As a customer, I want to search for room availability and view room details, so that I can find a suitable room.",
    "Acceptance Criteria (Confirmation)":"1. Search Room Availability:\nCustomers should be able to search for room availability based on below fields:\n\t-Check-in Date (Required)\n\t-Check-out Date (Required)\n\t-Number of Adults (Required, Default: 1)\n\t-Number of Children (Optional, Default: 0)\n\t-Room Type (Dropdown with predefined options,e.g., Standard, Deluxe, Suite)\n\t-Search Button\n\nWhen the search button is clicked, the system should validate all required fields.\nIf matching rooms are found:\n\t\t-The system should fetch available room details, price, and images based on the entered criteria.\n\t\t-Provide a \"Book Now\" button for available rooms.\nIf no rooms are available, a user-friendly message should be displayed. eg \"No rooms available for the selected dates. Please try different dates.\"\n\n2. Field Validations & Error Handling:\n\t1.Check-in Date Validation: \n\t\t-The field must be required.\n\t\t-The date must be in the future (i.e., today's date or later).\n\t\t-Selecting a past date should show an error:\n\t\t\t-\"Check-in date cannot be in the past.\"\n\t2.Check-out Date Validation:\n\t\t-The field must be required.\n\t\t-The date must be after the check-in date.\n\t3.Selecting a check-out date before check-in should show an error:\n\t\t-\"Check-out date must be after the check-in date.\"\n\t4.Number of Adults Validation:\n\t\t-The field must be required and default to 1.\n\t\t-The minimum value should be 1, and the maximum should be 10.\n\t\t-If the user enters 0 or a negative value, show an error: \"At least one adult must be selected.\"\n\t5.Number of Children Validation:\n\t\t-The field is optional and defaults to 0.\n\t\t-The maximum value should be 5.\n\t\t-Negative values should show an error: \"Number of children cannot be negative.\"\n\t6.Room Type Validation:\n\t\t-The dropdown should have predefined options (e.g., Standard, Deluxe, Suite).\n\t\t-The field must be selected before searching.\n\t\t-If left unselected, show an error: \"Please select a room type.\"\n\t7.Search Button Validation:\n\t\t-Should be disabled until all required fields are filled correctly.\n\t\t-Clicking without valid input should not proceed and display error messages.\n\t\t-If all inputs are valid, clicking should redirect to the results page.\n\t\t\t\n3. Displaying Search Results:\nAfter clicking Search, the system should display a list of available rooms matching the search criteria.Each room listing should include:\n\t\t-Room Type (e.g., Standard, Deluxe, Suite)\n\t\t-Price per Night (Displayed clearly in the hotel's currency)\n\t\t-Occupancy Limit (Max number of adults and children allowed)\n\t\t-Amenities (WiFi, TV, AC, Mini-bar, etc.)\n\t\t-Room Size (Displayed in square feet or meters)\n\t\t-Availability Status (Indicates whether the room is available or fully booked)\n\t\t-Book Now Button (Enabled if the room is available)\n\n4. Sorting & Filtering Options\nCustomers should be able to sort the search results by:\n\t-Price: Low to High \/ High to Low\n\t-Availability\nCustomers should be able to filter results by:\n\t-Price Range\n\t-Room Amenities\n\t-Room Size\n\n5. User Interaction & Navigation\n\t-Clicking \"Book Now\"(Enabled if the room is available) should redirect the customer to the booking form with pre-filled details based on the search.\n\nExpected User Flow:\n1️.User lands on the homepage.\n2️.User clicks on Search Room availability\n3️.User selects check-in and check-out dates.\n4️.User enters the number of adults and children.\n5️.User selects a room type from the dropdown.\n6️.User clicks Search (only enabled if all fields are valid).\n7️.System validates inputs and fetches available rooms with details.\n8️.If rooms are available, the user is redirected to the room selection page.\n9️.If no rooms are available, a message is shown: \"No rooms available for the selected dates. Please try different dates.\"\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":5,
    "Feature":"Book Room– Customer (Web)",
    "Story number":"US005",
    "Description (Card)":"As a customer, I want to book a room so that I can confirm my stay in the hotel.",
    "Acceptance Criteria (Confirmation)":"1. Booking Process Initiation\n\n\t-The customer must be logged in to proceed with booking.\n\t-The customer can initiate booking by clicking the \"Book Now\" button next to an available room in the search results.\n\t-Clicking \"Book Now\" should navigate the customer to the Booking Confirmation Page with pre-filled details based on the search criteria.\n\n2. Booking Confirmation Page\nThe page should display the following details retrieved from the selected room:\n\t-Room Type (Standard, Deluxe, Suite, etc.)\n\t-Price per Night (Including applicable taxes and discounts)\n\t-Check-in Date (Pre-filled from search)\n\t-Check-out Date (Pre-filled from search)\n\t-Total Number of Nights (Auto-calculated)\n\t-Number of Adults & Children (Pre-filled from search)\n\t-Total Cost Calculation (Price × Number of Nights + Taxes)\n\t-Customer Contact Details (Pre-filled with registered name, email, and phone number)\n\t-Special Requests (Optional) (Text field for requests like extra bed, late check-in, etc.)\n\t-Payment Options (Credit Card, Debit Card, UPI, Wallets, etc.)\n\t-Proceed to Pay button (On clicking should display payment gateway for secured transaction)\n\n3. Validation Rules\n\t-Check-in and check-out dates should be non-editable (customer must restart the search to change dates).\n\t-Number of adults and children should match the room occupancy limit (e.g., cannot exceed max limit).\n\t-Customers must select a payment method before proceeding.\n\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":6,
    "Feature":"Pay Bill (Web)",
    "Story number":"US006",
    "Description (Card)":"As a customer, I want to securely enter my payment details and complete the payment process, so that I can confirm my booking.",
    "Acceptance Criteria (Confirmation)":"1. Navigating to the Payment Screen\n\t-Clicking \"Proceed to Pay\" on the booking confirmation page should navigate to the Payment Screen for card payments.\n\t\n2. Payment Form Fields & Validations\nThe card payment form should include the following fields with validation:\n\t-Cardholder Name: Required, alphabetic characters only (Min: 3, Max: 50)\n\t-Card Number: Required, 16-digit numeric input\n\t-Expiry Date (MM\/YY):Required, must be in valid future format.\n\t-CVV: Required, 3-digit numeric input for VISA\/MasterCard, 4-digit for AMEX\n\t-Billing Address: Optional, but if entered, must be at least 5 characters\nValidations\n\t-Invalid inputs should display an inline error message.\n\t-If the card number is invalid, an error \"Invalid card number\" should be displayed.\n\t-Expired cards should show an error \"Card expiry date must be in the future.\"\n\t-If CVV is incorrect, show \"Invalid CVV. Please check again.\"\n\n3. Clicking \"Pay Now\" should:\n\t-Validate all inputs before proceeding.\n\t-Redirect to a secure payment gateway for transaction processing.\n\n4. Payment Success & Failure Handling\nOn successful payment:\n\t-Redirect to Booking Confirmation Page with success message \"Payment successful! Your booking is confirmed.\" and following details:\n\t\t1. Booking ID\n\t\t2. Payment transaction ID\n\t\t3. Customer Name\n\t\t4. Room Details\n\t\t5. Payment Amount\n\t\t6. Stay duration\n\t\t7. Receipt download option (PDF format)\nOn payment failure:\n\t-Display an error message: \"Transaction failed. Please check your details and try again.\"\n\t-Allow the user to retry or choose a different payment method.\nOn session timeout:\n\t-Redirect to the payment screen with a warning:\"Your session has expired. Please re-enter your payment details.\"\n\t\n5. Post-Booking confirmation\n\t-The customer should be able to View the booking under \"My Bookings\".\n\t-Cancel or modify the booking.\n\t-The system should prevent duplicate bookings for the same room and customer within the same dates.\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":7,
    "Feature":"Generate Invoice- Web",
    "Story number":"US007",
    "Description (Card)":"As a customer, I want to generate an invoice for my confirmed booking, so that I can keep a record of my payment and stay details.",
    "Acceptance Criteria (Confirmation)":"1. Accessing Invoice Generation\n\t-The customer must be logged in to generate an invoice.\n\t-The invoice should be accessible from:\n\t\t-Booking Confirmation Page (Immediately after successful payment).\n\t\t-\"My Bookings\" Section (For past bookings).\n\t-A \"Download Invoice\" button should be available for completed bookings.\n\n2. Invoice Details\nThe invoice should be auto-generated in a structured PDF format with the following details:\n\t-Hotel Name & Logo: Display at the top of the invoice.\n\t-Invoice Number: Unique system-generated invoice ID.\n\t-Booking ID:Unique booking reference number.\n\t-Customer Details: Name, registered email, mobile number.\n\t-Room Details: Room type, occupancy limit, price per night.\n\t-Check-in & Check-out Dates: Displayed in DD-MM-YYYY format.\n\t-Number of Nights: Auto-calculated based on check-in & check-out.\n\t-Number of Guests: Number of adults and children.\n\t-Base Price: Room price before tax.\n\t-Taxes & Charges: Breakdown of GST, service charges, and additional fees.\n\t-Total Amount Paid: Sum of base price + taxes.\n\t-Payment Method: Credit Card, UPI, Net Banking, etc.\n\t-Transaction ID: Unique payment transaction reference.\n\t-Invoice Date & Time: Timestamp of invoice generation.\n\t-Hotel Contact Information: Address, email, and customer support number.\n\n3. Invoice Validations & Conditions\n\t-Invoice should only be generated for completed and paid bookings.\n\t-The \"Download Invoice\" button should be disabled for:\n\t\t-Unpaid or canceled bookings.\n\t-If an invoice request fails, show an error message \"Invoice generation failed. Please try again later.\"\n\n4. Invoice Download & Sharing\n\t-Invoice should be downloadable as a PDF file.\n\t-Clicking \"Download Invoice\" should show a confirmation message: \"Your invoice has been successfully downloaded.\"",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":8,
    "Feature":"Booking History   (Web)",
    "Story number":"US008",
    "Description (Card)":"As a customer, I want to view my past and upcoming booking details, so that I can track my reservations and access related details like invoices.",
    "Acceptance Criteria (Confirmation)":"1. Accessing Booking History\nClicking \"Booking History\" should navigate to a page displaying past and upcoming bookings.\n\n2. Display of Booking Details\nThe booking history page should display two sections:\n\t-Upcoming Bookings (for future reservations).\n\t-Past Bookings (for completed stays).\n\nEach booking entry should include:\n\t-Booking ID: Unique booking reference number (clickable for full details).\n\t-Hotel Name & Location:\tThe booked hotel's name and address.\n\t-Room Type and\tRoom category (e.g., Deluxe, Suite, Standard).\n\t-Check-in & Check-out Dates: Displayed in DD-MM-YYYY format.\n\t-Number of Guests:\tNumber of adults and children.\n\t-Booking Status: (Confirmed, Checked-in, Checked-out, Canceled).\n\t-Total Amount: Displayed in the selected currency.\n\t-Payment Status: (Paid, Partially Paid, Pending).\n\t-Actions: Relevant options like View Details, Download Invoice, Cancel Booking.\n\n3. Actions for Upcoming Bookings:\n\t-\"View Details\" : Shows complete booking information.\n\t-\"Cancel Booking\" : Prompts a cancellation confirmation.\n\t-\"Modify Booking\" : Update the booking.\n\t-\"Download Invoice\": Generates and downloads the invoice in PDF only if booking is fully paid.\n\t\n4. Actions for Past Bookings:\n\t-\"View Details\" → Shows complete booking information.\n\t-\"Download Invoice\" → Generates and downloads the invoice in PDF.\n\n\n5. Validations & Error Handling\n\t-The booking history page should only show the logged-in user's bookings.\n\t-If there are no past or upcoming bookings, display: \"No bookings found. Start your journey by booking a room!\"\n\t-Clicking on a canceled booking should show a label: \"This booking was canceled on [date].\"\n\t-If invoice generation fails, show an error: \"Unable to generate invoice. Please try again later.\"\n\t-If the booking payment is pending show a message: \"Invoice will be available after full payment.\"\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":9,
    "Feature":"Update reservation -Web",
    "Story number":"US009",
    "Description (Card)":"As a customer, I want to modify my existing booking details, so that I can update my reservation as per my requirements.",
    "Acceptance Criteria (Confirmation)":"1. Accessing the Modify Booking Option\n\t-The \"Modify Booking\" button should be available only for upcoming bookings (not for past or canceled bookings).\n\t-Clicking \"Modify Booking\" should open a form allowing modifications.\n\n2. Editable Fields in the Modify Booking Form\nThe customer should be able to edit the following:\n\t-Check-in Date:\tMust be in the future; cannot be before the current date.\n\t-Check-out Date: Must be after check-in date.\n\t-Number of Adults:\tMust be at least 1; should not exceed room capacity.\n\t-Number of Children: Should not exceed room capacity.\n\t-Room Type:\tCan only be changed if available.\n\t-The system should display real-time availability when changing dates or room type.\n\n3. Restrictions on Modifications\n\t-Modifications should be allowed only before a certain cut-off time (e.g., 24 hours before check-in).\n\t-If the booking is partially paid or fully paid, changes should \n\t\t-Recalculate the total cost based on new details.\n\t\t-Show any additional amount payable or refund due.\n\t-If the room type is changed, the price difference should be adjusted accordingly.\n\t-If the modification results in a higher price, the user must pay the difference before confirming changes.\n\t-After modifying the booking, the customer must review and confirm changes.\n\t-A confirmation screen should show below details:\n\t\t-Updated booking details.\n\t\t-Any additional charges or refunds.\n\t\t-A \"Proceed to Pay\" button if extra payment is needed.\n\t-If the modification increases the price, the system should redirect the user to the payment screen before confirming changes.\n\t-If the modification reduces the price, the system should: Display a message: \"Your updated booking costs less. Refund (if applicable) will be processed as per the cancellation policy.\"\n\t-Once successfully modified, the system should: Update the booking history with modified details and Show a success message: \"Your booking has been successfully modified.\"\n\t-Allow the customer to download the updated invoice.\n\t\n4. Error Handling & Validations\n\t-If the modification is attempted after the allowed cut-off time, show an error: \"Modifications are not allowed within 24 hours of check-in. Please contact support.\"\n\t-If the selected room type is no longer available, display: \"The selected room type is fully booked for these dates. Please choose another option.\"\n\t-If payment fails for additional charges, show: \"Modification failed due to payment error. Please try again.\"\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":10,
    "Feature":"Cancel Booking (Web)",
    "Story number":"US010",
    "Description (Card)":"As a customer, I want to cancel my reservation, so that I can avoid unnecessary charges.",
    "Acceptance Criteria (Confirmation)":"The \"Cancel Booking\" button should be available only for upcoming bookings (not for past or already canceled bookings).\nClicking \"Cancel Booking\" should open a confirmation prompt asking the user to confirm the cancellation.\n\n1. Cancellation of booking\n\t-Free cancellation if done within the allowed period (e.g., 48 hours before check-in).\n\t-Partial refund if canceled within a certain timeframe (e.g., 24-48 hours before check-in).\n\t-No refund if canceled after the deadline (e.g., less than 24 hours before check-in).\n\t-Display a clear message about any refund eligibility before finalizing cancellation. Example: \"Canceling now will result in a 50% refund as per the hotel's cancellation policy. Do you want to proceed?\"\n\n2. Refund Processing\n\t-If eligible for a refund:\n\t\t-Calculate the refund amount based on the policy.\n\t\t-Display the refund amount before confirming cancellation.\n\t\t-Show a confirmation message: \"Your booking has been canceled. A refund of ₹XXXX will be processed within 3-5 business days.\"\n\t\t-If not eligible for a refund, display a warning: \"As per the hotel’s policy, this booking is non-refundable.\"\n\n3. Post-Cancellation of booking\n\t-After cancellation, the system should:\n\t\t-Remove the \"Modify Booking\" option for the canceled reservation.\n\t\t-Update the booking status in \"Booking History\" as \"Canceled\".\n\t\t-Disable the \"Download Invoice\" option.\n\n3. Error Handling & Validations\n\t-If cancellation is attempted after the allowed time, show: \"This booking cannot be canceled as it is past the allowed cancellation window.\"\n\t-If the booking is already checked in, do not allow cancellation\n* Use web concepts for the necessary actions if necessary.                                                                                                                                                        ",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":11,
    "Feature":"Register Complaint (Web)",
    "Story number":"US011",
    "Description (Card)":"As a customer, I want to register a complaint about my room, service, or billing issues, so that I can get my concerns addressed.",
    "Acceptance Criteria (Confirmation)":"Clicking on \"Register Complaint\" should open the complaint submission form.\n\n1. Complaint Registration Form Fields & Validations\n\t-Complaint Category: Mandatory dropdown with predefined options (Room Issue, Service Issue, Billing Issue, Other).\n\t-Booking ID : booking id of customer.\n\t-Complaint Title: Mandatory, min 10 characters, max 100 characters.\n\t-Complaint Description:\tMandatory, min 20 characters, max 500 characters. Should provide a clear explanation of the issue.\n\t-Contact Preference: Mandatory radio button (Call, Email).\n\t-Submit Button:\tEnabled only when all mandatory fields are filled.\n\t-Reset Button: Clears the form fields.\n\n2. When the user clicks \"Submit\", the system should:\n\t-Validate all inputs.\n\t-Generate a unique complaint reference number.\n\t-Store the complaint details in the database.\n\t-Display a confirmation screen with: \"Your complaint has been successfully submitted. Complaint ID: #XXXXXX. Our support team will get back to you soon.\"\n\t-The system should send a complaint acknowledgment SMS\/email with the complaint ID and expected resolution time.\n\t-Update the \"View Complaints\" section so that the customer can track the complaint status.\n\t-Allow the user to edit the complaint if it is in the \"Open\" status.\n\t\n3. Error Handling & Validations\n\t-If a mandatory field is missing, display an error: \"Please fill in all required fields.\"\n\t-If the complaint is too short, prompt: \"Please provide more details to help us resolve your issue.\"\n* Use web concepts for the necessary actions if necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":12,
    "Feature":"Track Complaint status (Web)",
    "Story number":"US012",
    "Description (Card)":"As a customer, I want to track the status of my complaint to see if it is resolved or in progress, so that I know when to expect a resolution.",
    "Acceptance Criteria (Confirmation)":"A \"View Complaints\" option should be available in the navigation menu. On clicking \"View Complaints\" should open a list of previously registered complaints.\n1. Displaying Complaint Details\n\t-The complaint list should display:\n\t\t-Complaint ID\n\t\t-Complaint Category (Room Issue, Service Issue, Billing Issue, Other)\n\t\t-Complaint Title\n\t\t-Submission Date\n\t\t-Current Status (Open, In Progress, Resolved, Closed)\n\t\t-Expected Resolution Date\n\t-If no complaints are found, display: \"You have not registered any complaints.\"\n\n2. Viewing Complaint Details\n\t-Clicking on a complaint should open a detailed complaint view, showing:\n\t\t-Full complaint description\n\t\t-Response from support team (if any)\n\t\t-Resolution notes (if resolved)\n\n3. Complaint Status Updates\n-The complaint should have a status that updates based on progress:\n\t-Open:\tComplaint has been submitted but not yet reviewed.\n\t-In Progress:\tSupport team is working on the resolution.\n\t-Resolved:\tIssue has been resolved, pending customer confirmation.\n\t-Closed:\tComplaint is closed and cannot be modified.\n-If a complaint is marked Resolved, the user should have an option to:\n\t-Confirm Resolution (marks it as Closed).\n\t-Reopen Complaint (if the issue is not resolved).\n-If a complaint is Closed, the customer should:\n\t-Be able to view but not edit the complaint.\n\t-View the final resolution details.\n\n4. Error Handling & Validations\n\t-If the user tries to view a complaint that does not exist: \"The complaint you are looking for does not exist or has been deleted.\"\n\t-If there is a server error, display: \"Unable to fetch complaint status. Please try again later.\"\n* Use web concepts for the necessary actions if necessary.          ",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":13,
    "Feature":"Update Profile details -Web",
    "Story number":"US013",
    "Description (Card)":"As a customer, I want to update my profile details, so that I can keep my information up to date.",
    "Acceptance Criteria (Confirmation)":" Clicking \"Profile\" should open a page displaying current user details.\n1. Editable Fields & Validations\n\t-Full Name:\tMandatory, min 2 characters, max 50 characters. No numbers or special characters allowed.\n\t-Email:\tMandatory, must be a valid email format.\n\t-Phone Number:\tMandatory, must include country code and be 10 digits long.\n\t-Address:\tOptional, max 100 characters.\nNon-editable fields: User ID (auto-generated during registration).\n\n2. Updating Profile Details\n\t-The user should be able to edit the fields and click \"Save Changes\".\n\t-Upon successful update, display a confirmation message: \"Your profile has been updated successfully.\"\n\t-The system should update the changes in the database.\n\n3. Error Handling & Validations\n\t-If any mandatory field is missing, show an error: \"Please fill in all required fields.\"\n\t-If the email format is incorrect, show: \"Please enter a valid email address.\"\n\t-If the phone number is invalid, show:\t\"Please enter a valid phone number with country code.\"",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":14,
    "Feature":"Admin Home page - Web",
    "Story number":"US014",
    "Description (Card)":"As an admin, I want to access the homepage to view features offered, so that I can manage the operations",
    "Acceptance Criteria (Confirmation)":"Only authorized admin users can access the admin home page. The home page should display a personalized welcome message (e.g., \"Welcome, <name>!\").\n\n1. Provide a clear navigation menu with links to:\n\t-Room Management.(list rooms, add room, Update room, remove room, search room by room number or type)\n\t-Booking Management.(view booking, add booking, update booking, cancel booking and search specific bookings by booking ID or guest name.)\n\t-User Management. (list users, add user, update user, remove user and search user by username or email)\n\t-Reports and Analytics.\n\t-Profile (Shows admin details, edit profile, logout)\n2. Dashboard Overview\n\t-Display total number of bookings (daily, weekly, monthly).\n\t-Number of available rooms.\n\t-Present data in graphical formats (e.g., charts, graphs) for quick analysis.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":15,
    "Feature":"Manage Rooms- Web",
    "Story number":"US015",
    "Description (Card)":"As an admin, I want to list\/edit the rooms, so that I can perform required operations like edit or remove rooms..",
    "Acceptance Criteria (Confirmation)":"Click on the 'Room Management' link to view the list of rooms. \n1. Room Listing Display\n\t-The system presents a paginated list of all rooms, displaying key details for each room, including:\n\t\t-Room Number\n\t\t-Room Type (e.g., Single, Double, Suite)\n\t\t-Price \n\t\t-Current Availability Status (Available\/Not Available) as on current date.\n\t\t-Amenities (e.g., Wi-Fi, TV, Mini-Bar)\n\t\t-Max Occupancy\n\t-Each room entry includes options to:\n\t\t-Edit: Modify room details.\n\n2. Sorting and Filtering\n\t-Administrators can sort the room list by any column in ascending or descending order.\n\t-Filtering options should be available to narrow down rooms based on criteria such as:\n\t\t-Room Type\n\t\t-Price Range\n\t\t-Availability Status\n\t\t-Amenities\n\t\t-Max Occupancy\n             -Date (On selecting a date it should list all the rooms available on that particular date)\n\n3. Search Functionality\n\t-A search bar allows administrators to quickly locate rooms by entering room number or type.\n\t\n4. Edit Room\t\nOn clicking the Edit Room link, the system allows modification of the following room attributes:\n-Room Type (e.g., Deluxe, Suite)\n-Bed Type (e.g., King, Queen)\n-Price per Night (Must be a positive numerical value.)\n-Room Status (e.g., Available, Occupied, Under Maintenance)\n-Amenities (e.g., Wi-Fi, Air Conditioning)\n\nValidations:\n-Room number should be non editable.\n-Administrators should receive a confirmation prompt detailing the room information before finalizing the update.\n-The system checks for active or upcoming reservations associated with the room. If found, updation is blocked, and an alert is displayed.\n-Rooms marked as 'Occupied' cannot be updated.\n-On successful updation, a confirmation message should be displayed \"Room<XXX> details are updated successfully.\"\n\n",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":16,
    "Feature":"Add Rooms - Web",
    "Story number":"US016",
    "Description (Card)":"As an admin, I want to add room details (room type, price, amenities, availability), so that I can manage the hotel inventory.",
    "Acceptance Criteria (Confirmation)":"On clicking \"Add Room\", the system provides an \"Add Room\" form with the following fields, each accompanied by specific validation rules:\n1. Add Room form\n-Room Number: Mandatory (Autogenerated, Maximum length: 6, Must be unique within the system)\n-Room Type:\tCategory of the room (e.g., Supreme, Deluxe, Suite), Mandatory, selection from predefined list of room types\n-Price: Cost per night for the room, Mandatory (Numeric value, Positive number)\n-Amenities:\tFeatures available in the room (e.g., Wi-Fi, TV, Mini-Bar).\t- Optional, selection from predefined list of amenities\n-Availability: Indicates if the room is available for booking ,Mandatory (Available\/Not Available)\n-Max Occupancy:\tMaximum number of guests allowed in the room, Mandatory (Integer value, Positive number)\n-Description:\tBrief description of the room, Optional(Text input, Maximum length: 500 characters)\n\n2. Validation and Error Handling\n- If the administrator attempts to submit the form with missing or invalid data: The system highlights the erroneous fields.\n- Displays descriptive error messages, e.g., \"Room Number is required and must be unique.\"\n- The system prevents form submission until all validations are satisfied.\n\n3. Successful scenario\n- After adding room, a success message should be displayed with details of added room.\n- Admin should have the option to add another room or return to dashboard.\n\n3.Bulk Add :\n-Provide an option within the \"Room Management\" section labeled \"Bulk Add\" or \"Import Rooms.\"\n\n4.CSV Import:\n-Enable administrators to upload a CSV file containing room details.\n-Provide a downloadable template to ensure correct formatting and required fields.\n-Upon upload, validate the data for completeness and accuracy before importing.\n-After successful upload, a success message should be displayed \"Bulk upload is successful\".",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":17,
    "Feature":"Manage Reservations - Web",
    "Story number":"US017",
    "Description (Card)":"As an Administrator, I want to view\/add\/modify\/delete customer reservations so that I can manage bookings effectively.",
    "Acceptance Criteria (Confirmation)":"1. View All Reservations\nOn clicking the View Reservations, the system displays a comprehensive list of all reservations with proper paginations, including details such as:\n\t-Reservation ID\n\t-Customer Name\n\t-Room Number\n\t-Check-in and Check-out Dates\n\t-Reservation Status (e.g., Confirmed, Checked-in, Cancelled)\n\n2. Sorting and Filtering: \n-Administrators can sort and filter reservations based on criteria like date range, room type, or reservation status to efficiently manage bookings.\n-For large sets of results, the system implements pagination to display a manageable number of records per page (e.g., 10 reservations per page).\n-Administrators can sort search results by any column in ascending or descending order.\n-Additional filters can be applied to narrow down results based on specific criteria (e.g., filtering by reservation status).\n\n3. List Reservation Display\nThe system displays results in a tabular format, including:\n\t-Reservation ID\n\t-Customer Name\n\t-Room Number\n\t-Check-in and Check-out Dates\n\t-Reservation Status\n\t-Total Amount\n\nWithin the results, administrators have access to quick action buttons for each reservation, such as:\n\t-Edit Reservation\n\t-Cancel Reservation\n\t\n4. Edit Reservations\nAdministrators can update reservation details, including:\n\t-Check-in and Check-out Dates\n\t-Assigned Room\n\t-Special Requests or Notes\n\nValidations:\n-Modifications to dates must not conflict with existing reservations or result in overbooking.\n-Reassigning a room should only be possible if the new room is available for the entire reservation period.\n-If a modification violates any validation rules, the system provides a clear error message, and the changes are not saved.\n\n5. Cancel Reservations\nAdministrators can cancel reservations, prompting:\n\t-A confirmation dialog to prevent accidental cancellations.\nValidations:\n-Reservations that are currently checked-in or already completed cannot be canceled.\n-Cancelled reservations remain in the system for record-keeping and reporting purposes but are marked distinctly as canceled.\n\n6. Create New Reservations\nAdministrators can access a form to input reservation details, including:\n-Customer Information:\n\t\t-Customer ID\n\t\t-Full Name\n\t\t-Contact Details (phone number and email address)\n-Reservation Details:\n\t\t-Check-in and Check-out Dates\n\t\t-Number of Guests\n\t\t-Room Type and Preferences\n-Payment Information:\n\t\t-Payment Method (e.g., credit card, cash)\n\t\t-Deposit Amount (if applicable)\n\nValidations:\n-The system checks that the selected room is available for the specified dates.\n\tConsider the below reservation dates of rooms where an admin is trying to book a reservation from 04-Mar till 07-Mar\n\tRoom No: Booking Dates\n\t101    : 01-Mar\n\t101    : 02-Mar\n\t101    : 05-Mar\n\t102    : 04-Mar\n\t102    : 03-Mar\n\t103    : 08-Mar\n\t104    : 03-Mar etc,\n\tHere the reservation should be made available for Room No 103 and Room No 104 for the requested dates.\n-All required information must be provided before saving the reservation.\n-Upon successful reservation, the system generates a unique reservation id and displays a confirmation message to the admin.\"You have successfully reserved the room\" along with reservation id and customer details.\t\n\n\n",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":18,
    "Feature":"Search Reservations- Web",
    "Story number":"US018",
    "Description (Card)":"As an administrator, I want to search customer reservations using various criteria so that I can efficiently manage bookings.",
    "Acceptance Criteria (Confirmation)":"1. Search reservation\nAdministrators can search reservations using the following criteria:\n-Reservation ID\n-Customer Name\n-Room Number\n-Check-in and Check-out Dates\n-Reservation Status (e.g., Confirmed, Checked-in, Cancelled)\n-Booking Date\n\n2. Input Validation\n-The system validates search inputs to prevent errors:\n-Date fields must be in the correct format (e.g., MM\/DD\/YYYY).\n-Text fields should not contain special characters unless necessary (e.g., hyphens in names).\n-If invalid input is detected, the system prompts the administrator to correct it.\n\n3. Search Results Display\nThe system displays search results in a tabular format, including:\n\t-Reservation ID\n\t-Customer Name\n\t-Room Number\n\t-Check-in and Check-out Dates\n\t-Reservation Status\n\t-Total Amount\n\nWithin the search results, administrators have access to quick action buttons for each reservation, such as:\n\t-Edit Reservation\n\t-Cancel Reservation\n-For large sets of results, the system implements pagination to display a manageable number of records per page (e.g., 10 reservations per page).",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":19,
    "Feature":"Manage Customer Accounts - Web",
    "Story number":"US019",
    "Description (Card)":"As an Administrator, I want to view\/create\/modify\/delete customer accounts so that I can manage operations effectively.",
    "Acceptance Criteria (Confirmation)":"1. Create User Accounts\n-Administrators must provide the following mandatory details when creating a new user account:\n\t-Username\n\t-Password (autogenerated. default password meeting defined security criteria, User should be able to change password on their first login). Encrypt the password while saving in the database using some industry accepted encryption mechanism.\n\t-Assigned Role(s)\n\t-Contact Information (e.g., email address)\n\n-Upon successful creation, the system displays a success message with account details and initial login instructions.\n\n2. View User Accounts\n-Administrators can access a comprehensive list of all user accounts, displayed in a tabular format with columns for:\n\t-Username\n\t-Assigned Role(s)\n\t-Account Status (e.g., Active, Inactive)\n\n-Search and Filter: \n\t-The system provides search and filter functionalities, allowing administrators to locate specific user accounts based on criteria such as username, role, or status.\n            -For large sets of results, the system implements pagination to display a manageable number of records per page (e.g., 10 reservations per page).\n\n-Sorting: \n\t-Administrators can sort the user list by any column in ascending or descending order to facilitate efficient account management.\n\n3. Update User Accounts\n-Administrators can modify the following user account details:\n\t-Assigned Role(s)\n\t-Contact Information\n\t-Account Status (e.g., activate or deactivate accounts)\n-Password Reset: \n\t-Administrators have the ability to reset user passwords. The system enforces the password policy during resets and prompts users to change their password upon first login after the reset.\n\n4. Delete User Accounts\n-Administrators can choose to deactivate\/reactivate user accounts:\n\t-Deactivation: Temporarily suspends the user's access without removing their account data.\n\t-Reactivation: Activate the deactivated user's access.\n\t-Confirmation Prompt: The system prompts administrators to confirm deactivation to prevent accidental removal of user accounts.eg: \"Are you sure you want to deactivate the customer?\"\n\t-After successful deactivation\/reactivation, a confirmation message should be displayed.\n\t-Status of customer should be changed to Inactive\/Active on updation.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":20,
    "Feature":"Search Bills- Web",
    "Story number":"US020",
    "Description (Card)":"As an Administrator, I want to search for bill information of a customer to retrieve specific billing details. ",
    "Acceptance Criteria (Confirmation)":"\n1. List Bills\n-The system displays a comprehensive list of bills in a tabular format, including:\n\t-Bill ID\n\t-Customer Name or ID\n\t-Date of Issue\n\t-Total Amount\n\t-Payment Status (e.g., Paid, Pending)\n-Sorting and Filtering: \n\t-Administrators can sort and filter bills based on criteria such as date, customer, amount, or payment status.\n\t-For extensive records, the system implements pagination to display a manageable number of bills per page, enhancing usability.\n\n2. Search Bill\n-Administrators can search bills using various criteria, including:\n\t-Bill ID\n\t-Customer Name or ID\n\t-Date Range\n\t-Payment Status\n-The system validates search inputs to ensure they meet required formats and criteria, prompting administrators to correct any errors.\n-Search Results Display: \n\t-The system presents search results in a clear, tabular format, allowing administrators to view, edit, or manage the bills as necessary.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":21,
    "Feature":"Manage Bills - Web",
    "Story number":"US021",
    "Description (Card)":"As an Administrator, I want to create new bills\/edit bills for customers so that all charges are accurately recorded.",
    "Acceptance Criteria (Confirmation)":"1. Add Bill\n-Administrators must provide the following mandatory details when creating a new bill:\n\t-Customer ID \n\t-Itemized List of Charges, including:\n\t\t-Room Charges\n\t\t-Service Charges (e.g., room service, spa)\n\t\t-Additional Fees (e.g., late checkout, minibar)\n\t-Applicable Taxes and Discounts\n\t-Total Amount Due\n-Input Validation: The system validates all inputs to ensure accuracy and completeness, prompting administrators to correct any errors before submission.\n-Upon successful creation, the system displays a success message and stores it in the customer's billing history.\n\nService Bill for Service charges:\n-Administrators can select from a predefined list of additional services (e.g., spa treatments, dining, room service).\n-The system allows for the inclusion of multiple services within a single bill.\n-For each service added to the bill, administrators must provide:\n\t-Service Date and Time\n\t-Description of the Service\n\t-Quantity (if applicable)\n\t-Unit Price\n\t-Applicable Taxes and Discounts\n\n2. Edit Bill\n-Administrators can modify the following bill details:\n\t-Itemized Charges\n\t-Taxes and Discounts\n\t-Total Amount Due\n-Input Validation: The system validates all modifications to ensure accuracy and completeness, prompting administrators to correct any errors before saving changes.",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":22,
    "Feature":"Manage Complaints – Admin",
    "Story number":"US022",
    "Description (Card)":"As an admin, I want to view and manage all customer complaints so that I can ensure prompt resolution.",
    "Acceptance Criteria (Confirmation)":"1. Complaint Dashboard\n-Administrators have access to a complaint dashboard displaying all complaints with key information:\n\t-Complaint ID\n\t-Customer Name\n\t-Submission Date\n\t-Category\n\t-Current Status\n\t-Assigned Staff Member\n\n2. Search and Filter Functionality:\n-Administrators can search and filter complaints based on various criteria, such as:\n\t-Date Range\n\t-Complaint Category\n\t-Status\n\t-Customer Name or ID\n\n3. Complaint Assignment:\n-Administrators can assign complaints to specific staff members or departments for resolution.\n-The system notifies the assigned personnel and updates the complaint status accordingly.\n\n4. Status Updates and Notifications:\n-The system allows administrators and assigned staff to update the status of complaints as they progress through resolution stages.\n\n5. Response and Resolution Tracking:\n-Administrators can record actions taken to address each complaint, including:\n\t-Date and Time of Actions\n\t-Details of Investigations or Interactions\n\t-Resolutions Provided",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  },
  {
    "SlNo":23,
    "Feature":"Manage Complaints- Staff",
    "Story number":"US023",
    "Description (Card)":"As a Staff, I want to view and manage relevant customer complaints so that I can ensure prompt resolution.",
    "Acceptance Criteria (Confirmation)":"\nStaffs have secure access to the complaint management system, with permissions tailored to their roles, allowing them to view and manage complaints relevant to their expertise.\n1. Complaint Assignment:\n-Complaints are categorized and assigned to Staff based on their area of expertise (e.g., billing, maintenance, housekeeping).\n-Staff receive notifications upon assignment of new complaints.\n\n2. Complaint Dashboard:\n-Staff have access to a personalized dashboard displaying complaints assigned to them, including key details such as:\n\t-Complaint ID\n\t-Customer Name\n\t-Date Submitted\n\t-Complaint Category\n\t-Current Status\n\t-Priority Level\n\n3. Detailed Complaint View:\n-Staffs can access comprehensive information on each complaint, including:\n\t-Full description of the issue\n\t-Customer interaction history if any\n\t-Previous actions taken\n\n4. Action Logging:\n-Staffs can document actions taken to resolve complaints, including:\n\t-Steps implemented\n\t-Communications with customers\n\t-Internal notes\n\t-Each action is timestamped.\n\n5. Status Updates:\n-Staffs can update the status of complaints (e.g., In Progress, Resolved, Escalated).",
    "Initial Size Estimate (SP)":null,
    "Business Priority":null,
    "Sprint Number":null,
    "Comments":null
  }
]